In [86]:
import requests
import json
import pandas as pd
from datetime import datetime

url = "https://apidojo-yahoo-finance-v1.p.rapidapi.com/stock/v2/get-historical-data"

querystring = {"frequency":"1d","filter":"history","period1":"1560643200","period2":"1592265600","symbol":"ZM"}

headers = {
    'x-rapidapi-host': "apidojo-yahoo-finance-v1.p.rapidapi.com",
    'x-rapidapi-key': "ec9831563dmsh5c355f85927aba5p1ac11ajsn43d369039a77"
    }

response = requests.request("GET", url, headers=headers, params=querystring)
j_bc = response.json()
## Convert Epoch dates to datetime
df_bc = pd.DataFrame(j_bc['prices'], columns=['date','open', 'high','low','close','volume','adjclose'])
df_bc['date'] = pd.to_datetime(df_bc['date'], unit= 's')
df_bc['date'] = df_bc['date'].dt.date
cols = ['open','high','low','close','volume']
## Rounding to the 2nd decimal
df_bc = df_bc[cols].round(2)
df_bc
## 


#df_bc.to_json("../data/zoom_shareprice.json")

       open    high     low   close    volume
0    227.84  239.59  226.38  239.02  13959100
1    224.79  231.45  216.75  219.52   8766000
2    219.18  232.00  218.50  222.07  17615800
3    208.89  221.53  208.26  221.02  12241100
4    209.83  210.59  202.93  205.43   7521800
..      ...     ...     ...     ...       ...
247  101.42  101.53   97.82  100.47   2972500
248  105.01  107.34  101.62  102.30   2460700
249  100.49  104.44   98.63  102.39   2592700
250  100.39  102.00   97.51   99.64   2272400
251  101.00  102.45   97.00   98.11   2128500

[252 rows x 5 columns]

In [23]:
df_bc['date']


## add another columns that substract both high and low 
## just delete uneeded columns
## export to json

0      1592227800
1      1591968600
2      1591882200
3      1591795800
4      1591709400
          ...
247    1561123800
248    1561037400
249    1560951000
250    1560864600
251    1560778200
Name: date, Length: 252, dtype: int64